const data = {
    "trees" : [
        {
            "id": 1,
            "name" : "פיקוס בנגלי",
            "family": "תותיים",
            "origin" : "הודו והאזורים הטרופיים של דרום מזרח אסיה",
            "text" : "פיקוס בנגלי הוא עץ ירוק-עד גדול וחזק ובעל עמידות במחלות ובמזיקים. העץ מצמיח שורשי אוויר רבים, בעיקר כאשר הוא גדל באזורים לחים, ואלה מתעבים לגזעים המשתרשים בקרקע ובתוך כך תומכים בהתפשטות העץ על שטח רחב במיוחד.",
            "link" : "https://he.wikipedia.org/wiki/%D7%A4%D7%99%D7%A7%D7%95%D7%A1_%D7%91%D7%A0%D7%92%D7%9C%D7%99"
        },
        {
            "id": 2,
            "name" : "פיקוס השקמה",
            "family": "תותיים",
            "origin" : "אפריקה הטרופית",
            "text" : "השקמה פורחת כמעט כל השנה. פרחיה הם חד מיניים. התפרחת, בצורת פגה האופיינית למיני פיקוס נוספים כגון תאנה, זכתה גם לכינוי ג'ומס. היא טובה למאכל אדם, אך נחותה בטעמה מתאנה וכיום היא חסרת ערך מסחרי. ",
            "link" : "https://he.wikipedia.org/wiki/%D7%A9%D7%A7%D7%9E%D7%94"
        },
        {
            "id": 3,
            "name" : "אקליפטוס לימוני",
            "family": "הדסיים",
            "origin" : "אוסטרליה",
            "text" : "עץ ירוק-עד, חסכן במים. בעלי האיקליפטוס הלימוני יש שמנים אתריים המְ פיצים ריח לימון, כשממוללים אותם, ומכאן שמו. בעל קליפה חלקה בגוון לבן-אפרפר, לעתים בכתמי צבע ורדרדים. האיקליפטוס הלימוני מאופיין בגזע זקוף, הנישא לגובה רב. כמעט אין בו נוף עלים. עיקר הנוף נמצא בחלקו העליון.",
            "link" : "https://he.wikipedia.org/wiki/%D7%90%D7%A7%D7%9C%D7%99%D7%A4%D7%98%D7%95%D7%A1_%D7%9C%D7%99%D7%9E%D7%95%D7%A0%D7%99"
        },
        {
            "id": 4,
            "name" : "צפצפת הפרת",
            "family": "ערבתיים",
            "origin" : "אזור הים התיכון",
            "text" : "עץ נשיר הגדל בר בארץ, העלווה בגוון אפרפר, וצהובה-חומה בזמן הנשירה, המשווה לעץ מראה מרהיב בסתיו, בעיקר בגדות נחלים ליד מקורות מים. מאפיין ייחודי נוסף של העלים הוא ההבדל בין צורתם בהיותם צעירים )צרים וארוכים( לצורתם בהיותם בוגרים )דמוי מעוין(. רוב גזעי צפצפות הפרת גדלים במעוקם. ",
            "link" : "https://he.wikipedia.org/wiki/%D7%A6%D7%A4%D7%A6%D7%A4%D7%AA_%D7%94%D7%A4%D7%A8%D7%AA"
        },
        {
            "id": 5,
            "name" : "טקסודיון דו-טורי",
            "family": "טקסודיים",
            "origin" : " דרום מזרח ארצות הברית ומקסיקו",
            "text" : "עץ גדול בעל מראה ציורי בולט. ענפיו ועליו בכותיים. משמש עץ נוי ואינו נפוץ. העץ נשיר מותנה, לעתים בגֹוני שלכת אדומים. שמו העממי - ברוש ביצות. לטקסודיון גזע דקורטיבי מרשים מאוד בבגרותו. ",
            "link" : "https://he.wikipedia.org/wiki/%D7%98%D7%A7%D7%A1%D7%95%D7%93%D7%99%D7%95%D7%9F_%D7%93%D7%95-%D7%98%D7%95%D7%A8%D7%99"
        },
        {
            "id": 6,
            "name" : "קיגליה מנוצה",
            "family": "ביגנוניים",
            "origin" : "אפריקה",
            "text" : "הקיגליה הוא עץ שאינו נפוץ והוא ייחודי בזכות פרחיו ופירותיו. הפרחים הגדולים בצבע ארגמן חזק גדלים על עוקצים ארוכים, דמויי חוטים המשתלשלים מן הענפים. גם הפירות הכבדים, באורך של כ30- ס“מ, התלויים על העץ זמן רב לאחר הפריחה, ייחודיים ויש להם ערך קישוטי. ",
            "link" : "https://he.wikipedia.org/wiki/%D7%A7%D7%99%D7%92%D7%9C%D7%99%D7%94_%D7%9E%D7%A0%D7%95%D7%A6%D7%94"
        },
        {
        "id": 7,
            "name" : "פיקוס קדוש",
            "family": "תותיים",
            "origin" : "הודו ודרום מזרח אסיה",
            "text" : "עץ ירוק-עד גדול, המשיר את עליו בסוף האביב בגֹוני שלכת צהובים, ומלבלב מיד לאחר מכן. בעל קצב גידול מהיר, שורשים תוקפניים במיוחד ופירות עסיסיים ומלכלכים. הפיקוס הקדוש מקודש לרבים בארצות המזרח הרחוק ומכאן שמו. ",
            "link" : "https://he.wikipedia.org/wiki/%D7%A4%D7%99%D7%A7%D7%95%D7%A1_%D7%A7%D7%93%D7%95%D7%A9" 
        },
        {
            "id": 8,
            "name" : "צאלון נאה",
            "family": "קטניתיים",
            "origin" : "מדגסקר",
            "text" : "עץ בעל נוף רחב, נשיר מותנה, פורח בגֹוני אדום-כתום בוהקים במהלך הקיץ, הפרי - תרמיל צר וארוך בצבע ירוק ההופך לחום. רגיש לקור. ",
            "link" : "https://he.wikipedia.org/wiki/%D7%A6%D7%90%D7%9C%D7%95%D7%9F_%D7%A0%D7%90%D7%94"
        },
        {
            "id": 9,
            "name" : "אלון השעם",
            "family": "אלוניים",
            "origin" : "דרום אירופה וצפון אפריקה",
            "text" : "עץ גדול וירוק-עד. מאריך ימים. ייחודו של העץ בגזע המיוחד המצופה שעם שאותו נהוג לקלף בכל כמה שנים לייצור מוצרי שעם. הקילוף אינו גורם נזק לעץ ",
            "link" : "https://he.wikipedia.org/wiki/%D7%90%D7%9C%D7%95%D7%9F_%D7%94%D7%A9%D7%A2%D7%9D"
        },
        {
            "id" : 10,
            "name" : "כוריזיה בקבוקית",
            "family": "בומבקיים",
            "origin" : "ארגנטינה, פרו",
            "text" : "העץ מאופיין בגזע מעובה במיוחד המקנה לו צורה של בקבוק ומכאן שמו. צבע הגזע ירוק והוא בעל קוצים גדולים וחדים. פרי הכוריזיה מזכיר בצורתו את האבוקדו. לאחר הבשלתו הוא נפתח ובוקע ממנו צמר גפן, שבו נמצאים הזרעים. ",
            "link" : "https://he.wikipedia.org/wiki/%D7%9B%D7%95%D7%A8%D7%99%D7%96%D7%99%D7%94_%D7%91%D7%A7%D7%91%D7%95%D7%A7%D7%99%D7%AA"
        }
    ]
}

//לאחר טעינת העמוד
document.addEventListener("DOMContentLoaded", function (event) {

});